/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mediagraph_Landmark {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub visibility: f32,
    pub presence: f32,
}
#[test]
fn bindgen_test_layout_mediagraph_Landmark() {
    assert_eq!(
        ::std::mem::size_of::<mediagraph_Landmark>(),
        20usize,
        concat!("Size of: ", stringify!(mediagraph_Landmark))
    );
    assert_eq!(
        ::std::mem::align_of::<mediagraph_Landmark>(),
        4usize,
        concat!("Alignment of ", stringify!(mediagraph_Landmark))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mediagraph_Landmark>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mediagraph_Landmark),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mediagraph_Landmark>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(mediagraph_Landmark),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mediagraph_Landmark>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mediagraph_Landmark),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mediagraph_Landmark>())).visibility as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(mediagraph_Landmark),
            "::",
            stringify!(visibility)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mediagraph_Landmark>())).presence as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mediagraph_Landmark),
            "::",
            stringify!(presence)
        )
    );
}
pub const mediagraph_GraphType_POSE: mediagraph_GraphType = 0;
pub const mediagraph_GraphType_HANDS: mediagraph_GraphType = 1;
pub const mediagraph_GraphType_FACE: mediagraph_GraphType = 2;
pub type mediagraph_GraphType = ::std::os::raw::c_uint;
#[repr(C)]
pub struct mediagraph_Mediagraph__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct mediagraph_Mediagraph {
    pub vtable_: *const mediagraph_Mediagraph__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_mediagraph_Mediagraph() {
    assert_eq!(
        ::std::mem::size_of::<mediagraph_Mediagraph>(),
        8usize,
        concat!("Size of: ", stringify!(mediagraph_Mediagraph))
    );
    assert_eq!(
        ::std::mem::align_of::<mediagraph_Mediagraph>(),
        8usize,
        concat!("Alignment of ", stringify!(mediagraph_Mediagraph))
    );
}
extern "C" {
    #[link_name = "\u{1}__ZN10mediagraph10Mediagraph6CreateENS_9GraphTypeEPKcS3_"]
    pub fn mediagraph_Mediagraph_Create(
        graph_type: mediagraph_GraphType,
        graph_config: *const ::std::os::raw::c_char,
        output_node: *const ::std::os::raw::c_char,
    ) -> *mut mediagraph_Mediagraph;
}
impl mediagraph_Mediagraph {
    #[inline]
    pub unsafe fn Create(
        graph_type: mediagraph_GraphType,
        graph_config: *const ::std::os::raw::c_char,
        output_node: *const ::std::os::raw::c_char,
    ) -> *mut mediagraph_Mediagraph {
        mediagraph_Mediagraph_Create(graph_type, graph_config, output_node)
    }
}
extern "C" {
    #[link_name = "\u{1}__ZN10mediagraph10MediagraphD1Ev"]
    pub fn mediagraph_Mediagraph_Mediagraph_destructor(this: *mut mediagraph_Mediagraph);
}
extern "C" {
    #[link_name = "\u{1}__ZN10mediagraph10Mediagraph7ProcessEPhii"]
    pub fn mediagraph_Mediagraph_Process(
        this: *mut ::std::os::raw::c_void,
        data: *mut u8,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> *mut mediagraph_Landmark;
}
